[
  {
    "id": 1,
    "title": "Volaverse: The Education Metaverse",
    "date": "August 29, 2022",
    "content": [
      {
        "img": "https://www.volaverse.com/assets/blog1_img.jpg",
        "desc": "Since October’2021, when Facebook changed its name to ‘Meta’, a new term has been taking rounds in the market, ‘METAVERSE’. But what is a Metaverse? Is it a game? Is it another social media platform? Or is it just a new gimmick in fad? Well, why don’t we begin to explaining what Metaverse is and leave the decision to the readers to decide what actually is a Metaverse\n\nMetaverse, to define in a single sentence, is a “Virtual 3D World” located on the internet. It allows users to meet, socialise, play, work and study in a virtually shared 3D world. A small trivia here: Are games like ‘Vice City’, ‘San Andreas’ truly a Metaverse? Well the answer is Yes and No.\n\nAlthough these games do have a virtual space designed for us to explore through gamification but yet they don’t support a shared infrastructure for any two users simultaneously. A true metaverse let’s any two users share a virtual space and experience it in ways that is unique to every user. Developers have further pushed the boundaries of what a Metaverse is, through hosting events and creating virtual economies exclusive for Metaverse.\n\nAlthough not necessary, but, integrating Blockchain with Metaverse can be a great fit. They allow for creating a digital economy with different types of utility tokens and virtual collectibles (NFTs). The metaverse would also benefit from the use of crypto wallets, such as MetaMask. Also, blockchain technology can provide transparent and reliable governance systems, coz afterall we have no choice left but to build a Virtual world to run away from physical world.\n\nDecentraland, Somnium Space, Sandbox, Axie Infinity etc. are some of the examples of Metaverses. There is a new Metaverse knocking the doors of the space: VOLAVERSE: THE EDUCATION METAVERSE"
      },
      {
        "img": "https://www.volaverse.com/assets/blog1_img2.jpg",
        "desc": "Volaverse is a community driven education metaverse built on the blockchain. In Volaverse, users can own digital estates and other assets, socialize, learn and teach about <em>Blockchain, Web3.0 and Metaverse</em>. It provides an infrastructure to support a shared virtual world. It consists of a decentralized ledger for content consumed and created and land ownership to run courses, and a peer-to-peer network for user interactions."
      },
      {
        "img": "https://www.volaverse.com/assets/blog1_img3.jpg",
        "desc": "Users\n1. Consumers: Their role is to explore courses in Volaverse in accordance with their interests and skills. They also act as critics for the course they undertake and provide feedback on the course and instructor to make it easier for others to decide\n\n2. Creators: They buy/rent space in Volaverse to take up classes based on their expertise. They also rate/grade their students which adds to the student’s profilelympiads by preparing chapter-by-chapter. All Olympiad participants have found the monthly online examinations to be quite beneficial.\n\nProduct\nVolaverse: First of its kind 3D immersive learning platform for Web3.0 enthusiasts.\n\nVolabuild: In-house builder tool to build on land. Features different objects for décor and utility in classroom.\n\nVolastore: Marketplace for users to trade digital land NFTs of Volaverse. Features other NFTs like avatar wearables, décor items etc.\n\nTeam\nThe team building Volaverse is group of highly enthusuastic and curious people who want to learn more about the Web3.0 and blockchain space and help others get to know the space better too.\n\nThe team of ‘Founding Members’ consist of two: Ujjwal Singla and Swati Goyal. Both of them together bring a cummulative of 10+ experience in fields like Edtech, Marketing, Planning and Project Management.\n\nThe advisory panel have the Gurus of Education and Crypto world: Deepak Goyal (Chief-Educator YSchool) and Litesh Gumber (CEO, Cryptic Entertainments). Then there is a Design team and Tech team working together to bring out a Metaverse for all the enthusiasts around the Globe.\n\nFuture Plans\nRight now the team of Volaverse is focussing on building a beta version and launching it on the test net for the users to test it and so we can build better on the feedback.Apart from that since we are talking about the Web3 space, how can we leave community out of the picture?\n\nWe are focussing on building a community of like minded people. All the readers do follow us on Twitter for more updates around the project.We will have associations with educators in the space for parternship to build valuable courses for the curious people who want to know more about the space.\n\nTechnology\nVolaverse is build on lisk using the Lisk SDK all the trasactions on Volaverse will be decentralised and take place. Being nurtured under the Lisk Grant Program, team at Volaverse is sure to excel and move swiftly towards the team holds."
      }
    ]
  },
  {
    "id": 2,
    "title": "Volaverse: Creator's Incentivization Model",
    "date": "Oct 11, 2022",
    "content": [
      {
        "img": "https://www.volaverse.com/assets/blog2_img.jpg",
        "desc": "“Creator”, is a word even used to describe God. For any platform, Creators have always been the soul of the project, because they pour life into the platform. Without creators there would be no content for the users to consume and hence no User Engagement. Although, this has been the case since the beginning of the Web2 era, yet, the entrepreneurs have always focused on incentivising the consumers first and the term “Creator’s Economy” has just started making rounds in recent times."
      },
      {
        "img": "https://www.volaverse.com/assets/blog2_img2.jpg",
        "desc": "With the beginning of the era of Web3 and decentralization kicking in, focus on Creator’s Economy has justifiably increased. When we talk about pillars of “Volaverse: The Education Metaverse”, Creator is definitely one of them. Without Creators, Volaverse can never succeed in its mission. Here we are going to discuss how onboarding and incentivisation for Creators is going to take place in Volaverse.\n\nFavorable and unique propositions are needed to onboard creators. Creators need to see the value in the platform for their and the ecosystem’s growth. If you are a creator or even a learner in Web3.0 space and want to spread your knowledge, do go through the following models and get onboarded with Volaverse to make an early stride in this Oh so exciting space of Metaverse.\n\nOnbaording Creators:\n1. DAO Fund for Creators:\nA separate fund for Creators will be maintained with the DAO which will be used for the following:\n- Grants: Applications for grants by Creators will be invited by the DAO and based on the profile of the Creators and the value proposition, grants will be allocated to the creators for Land acquisition and course building.\n\n2. Demo Lands:\nIf a creator wants to test the foot fall or wants to demonstrate their skill. Some Plots for Demo courses will be owned by the DAO for such creators.Here creators will be able to run a full course without having to pay for the land or the building. However, The Revenue generated from these courses will come to DAO.\n\n3. Packages:\nOnboarding packages will be formed for all the creators consisting of the following:\n- Announcement: New Course announcement spots in the Volocator and other common points will be provided.\n- Community Call: A Twitter space or a Discord/Telegram community call will be arranged with all the Creators to introduce them to the community.\n- Tech Assistance: Based on the portfolio and the decision of the DAO tech assistance with constructing the building and integrating the course content and building the course will be provided by in-house experts\n\nIncentivization Plan:\nFollowing are the Incentivisation and Revenue streams for the creators on Volaverse:\n1. Content Monetization:\nThe creators will be able to sell their courses on Volaverse as per following:\n- Organic reach: If a user reaches a course organically the entire amount of the course fees will go to the creator.\n- Recommendation: If a user reaches a course via the search/recommendation of the platform’s engine, a part of the fees will go to the DAO.\n2. DAO Rewards:\nThe DAO will reward the top 3 creators every month based on the ratings and Paid Minutes in that month.\n3. NFTs:\n- The Creators will get In-game points based on the viewership (Free content and paid content) and ratings on their courses.\n- Based on milestones set, the creators will get level-up badge NFTs. And the points they earn in the game will have different multipliers based on the level the creator is at."
      }
    ]
  },
  {
    "id": 3,
    "title": "Volaverse: MVP Launch",
    "date": "Dec 06, 2022",
    "content": [
      {
        "img": "https://www.volaverse.com/assets/blog3_img.jpg",
        "desc": "INTRODUCTION:\n\n'Volaverse: The Education Metaverse’ is a community driven Education Metaverse built on blockchain. In Volaverse, users can:\n1. Trade assets like digital estates (land spacesin the metaverse), Wearables, other collectibles.\n2. Learn and Teach about Blockchain, Web3.0 and Metaverse concepts.\n3. Build skill profile with certificate NFTs for the authenticity of the courses undertaken by the learners.S\n4. Socialise with other people in a 3D immersive environment.\n\nVOLAVERSE 0.0:\n\nThe MVP consists of 2 parts:\n1. Volaverse : This is the sample Metaverse. Currently it consists of Sample lands of 16x16 sq. meters area and “Volocator”, which is the central lobby where the journey of every user will start from.\n2. Volastore : This is in-house marketplace where the user can buy assets like Digital lands, wearables, collectibles etc.\nThe MVP showcases the digital estate buy/sell functionscarried out on the Lisk Blockchain dev net."
      },
      {
        "img": "https://www.volaverse.com/assets/blog3_img2.jpg",
        "desc": "DEVELOPERS SECTION:\n\n\nBackend:\nVolaverse uses Lisk blockchain to store all the NFT data and user data. Lisk blockchain is built on the top of Node JS. All the transactions for selling, buying, minting and transferring are done on the blockchain itself. The blockchain application has various endpoints which are used by the frontend (Both the MVP and the Marketplace) to interact with blockchain.\n\nFrontend:\nMVP - MVP is developed on unity game engine. Users can login with lisk credentials after choosing a username and filling up the basic details. Users can also create a new account or login as a guest. After login the user is transported to “Volocator” where they can see the information about the courses running in Volocator. Users can also transport to the land which are associated with the land NFTs and can also checkout the details of various land NFTs.\nMarketplace - Marketplace is built using React. Here, the user can either login using their existing credentials or create new credentials. After logging in, the user can see the lands NFTs present in the marketplace and can buy the ones which are available for sale. User can also get faucet funds from the marketplace itself as it is on the dev net right now.\n\nThe development on lisk SDK is different from the one on EVM blockchains. Our experience has been great working on Lisk as it provides a more in depth understanding of how a blockchain works. The documentation available is very detailed and code from the Github repository was a great support in understanding the concepts. The Lisk Discord community is very prompt in resolving any queries relatedto development too.\n\nNEXT STEPS:\n\nWe have the following development roadmap in the pipeline:\n1.  Launching first course on Basics of Blockchainin the Metaverse\n2. Making builder tool for the classrooms andcourses for the creators\n3. Introducing the Avatar gameplay in the MVP\n4. Introducing a talk series in Volaverse itself."
      }
    ]
  }
]